IRP/src/Documents/SalesReportFromTradeAgent/SalesReportFromTradeAgent.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>SalesReportFromTradeAgent</name>
 <registerRecords>InformationRegister.T2015S_TransactionsInfo</registerRecords>
 <registerRecords>InformationRegister.T6020S_BatchKeysInfo</registerRecords>
 <registerRecords>AccumulationRegister.R6060T_CostOfGoodsSold</registerRecords>
 <registerRecords>AccumulationRegister.R5010B_ReconciliationStatement</registerRecords>
 <registerRecords>AccumulationRegister.R4010B_ActualStocks</registerRecords>
 <registerRecords>AccumulationRegister.R4050B_StockInventory</registerRecords>
 <registerRecords>AccumulationRegister.R9010B_SourceOfOriginStock</registerRecords>
 <registerRecords>AccumulationRegister.R2001T_Sales</registerRecords>
 <registerRecords>AccumulationRegister.R2021B_CustomersTransactions</registerRecords>
 <registerRecords>AccumulationRegister.R2020B_AdvancesFromCustomers</registerRecords>
 <registerRecords>AccumulationRegister.R5021T_Revenues</registerRecords>
 <registerRecords>AccumulationRegister.R2040B_TaxesIncoming</registerRecords>
 <registerRecords>AccumulationRegister.R6020B_BatchBalance</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <attributes>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceIncludeTax</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalNameContract</name>
  <type>
   <types>CatalogRef.LegalNameContracts</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeType</name>
  <type>
   <types>EnumRef.TradeAgentFeeTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>ConsignorPrice</name>
   <type>
    <types>DefinedType.typePrice</types>
   </type>
  </attributes>
  <attributes>
   <name>Price</name>
   <type>
    <types>DefinedType.typePrice</types>
   </type>
  </attributes>
  <attributes>
   <name>PriceType</name>
   <type>
    <types>CatalogRef.PriceTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TotalAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>NetAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>DontCalculateRow</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityInBaseUnit</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>UseSerialLotNumber</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>IsService</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>Detail</name>
   <type>
    <types>DefinedType.typeDescription</types>
   </type>
  </attributes>
  <attributes>
   <name>AdditionalAnalytic</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>TradeAgentFeePercent</name>
   <type>
    <types>DefinedType.typePercent</types>
   </type>
  </attributes>
  <attributes>
   <name>TradeAgentFeeAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityIsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>VatRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
  <attributes>
   <name>Project</name>
   <type>
    <types>CatalogRef.Projects</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>DELETE_TaxList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Tax</name>
   <type>
    <types>CatalogRef.Taxes</types>
   </type>
  </attributes>
  <attributes>
   <name>Analytics</name>
   <type>
    <types>CatalogRef.TaxAnalytics</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IncludeToTotalAmount</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>ManualAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyFrom</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Rate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ReverseRate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowReverseRate</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Multiplicity</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SerialLotNumbers</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SourceOfOrigins</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
  <attributes>
   <name>SourceOfOrigin</name>
   <type>
    <types>CatalogRef.SourceOfOrigins</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Enums/TradeAgentFeeTypes/TradeAgentFeeTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>TradeAgentFeeTypes</name>
 <enumValues>
  <name>Percent</name>
 </enumValues>
 <enumValues>
  <name>DifferencePriceConsignorPrice</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/SalesReportFromTradeAgent/Forms/DocumentForm/Module.bsl
#Region FORM

&AtServer
Procedure OnReadAtServer(CurrentObject)
	DocSalesReportFromTradeAgentServer.OnReadAtServer(Object, ThisObject, CurrentObject);
	SetVisibilityAvailability(CurrentObject, ThisObject);
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	DocSalesReportFromTradeAgentServer.OnCreateAtServer(Object, ThisObject, Cancel, StandardProcessing);
	If Parameters.Key.IsEmpty() Then
		SetVisibilityAvailability(Object, ThisObject);
	EndIf;
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	AddAttributesAndPropertiesServer.BeforeWriteAtServer(ThisObject, Cancel, CurrentObject, WriteParameters);
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	DocSalesReportFromTradeAgentServer.AfterWriteAtServer(Object, ThisObject, CurrentObject, WriteParameters);
	SetVisibilityAvailability(CurrentObject, ThisObject);
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	DocSalesReportFromTradeAgentClient.OnOpen(Object, ThisObject, Cancel);
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If EventName = "UpdateAddAttributeAndPropertySets" Then
		AddAttributesCreateFormControl();
	EndIf;
	
	If EventName = "NewBarcode" And IsInputAvailable() Then
		SearchByBarcode(Undefined, Parameter);
	EndIf;

	If Not Source = ThisObject Then
		Return;
	EndIf;
EndProcedure

&AtServer
Procedure OnWriteAtServer(Cancel, CurrentObject, WriteParameters)
	DocumentsServer.OnWriteAtServer(Object, ThisObject, Cancel, CurrentObject, WriteParameters);
EndProcedure

&AtClient
Procedure AfterWrite(WriteParameters)
	DocSalesReportFromTradeAgentClient.AfterWriteAtClient(Object, ThisObject, WriteParameters);
EndProcedure

&AtClient
Procedure API_Callback(TableName, ArrayOfDataPaths) Export
	API_CallbackAtServer(TableName, ArrayOfDataPaths);
EndProcedure

&AtServer
Procedure API_CallbackAtServer(TableName, ArrayOfDataPaths)
	ViewServer_V2.API_CallbackAtServer(Object, ThisObject, TableName, ArrayOfDataPaths);
EndProcedure

&AtClient
Procedure FormSetVisibilityAvailability() Export
	SetVisibilityAvailability(Object, ThisObject);
EndProcedure

&AtClientAtServerNoContext
Procedure SetVisibilityAvailability(Object, Form)
	Form.Items.LegalName.Enabled = ValueIsFilled(Object.Partner);
	Form.Items.EditCurrencies.Enabled = Not Form.ReadOnly;
	Form.Items.ItemListTradeAgentFeePercent.Visible = 
		Object.TradeAgentFeeType = PredefinedValue("Enum.TradeAgentFeeTypes.Percent");
	
	_QuantityIsFixed = False;
	For Each Row In Object.ItemList Do
		If Row.QuantityIsFixed Then
			_QuantityIsFixed = True;
			Break;
		EndIf;
	EndDo;
	Form.Items.ItemListQuantityIsFixed.Visible = _QuantityIsFixed;
	Form.Items.ItemListQuantityInBaseUnit.Visible = _QuantityIsFixed;
	Form.Items.EditQuantityInBaseUnit.Enabled = Not _QuantityIsFixed;
EndProcedure

&AtClient
Procedure _IdeHandler()
	ViewClient_V2.ViewIdleHandler(ThisObject, Object);
EndProcedure

&AtClient
Procedure _AttachIdleHandler() Export
	AttachIdleHandler("_IdeHandler", 1);
EndProcedure

&AtClient 
Procedure _DetachIdleHandler() Export
	DetachIdleHandler("_IdeHandler");
EndProcedure

#EndRegion

#Region _DATE

&AtClient
Procedure DateOnChange(Item)
	DocSalesReportFromTradeAgentClient.DateOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region COMPANY

&AtClient
Procedure CompanyOnChange(Item) Export
	DocSalesReportFromTradeAgentClient.CompanyOnChange(Object, ThisObject, Item);
EndProcedure

&AtClient
Procedure CompanyStartChoice(Item, ChoiceData, StandardProcessing)
	DocSalesReportFromTradeAgentClient.CompanyStartChoice(Object, ThisObject, Item, ChoiceData, StandardProcessing);
EndProcedure

&AtClient
Procedure CompanyEditTextChange(Item, Text, StandardProcessing)
	DocSalesReportFromTradeAgentClient.CompanyEditTextChange(Object, ThisObject, Item, Text, StandardProcessing);
EndProcedure

#EndRegion

#Region TRADE_AGENT_FEE_TYPE

&AtClient
Procedure TradeAgentFeeTypeOnChange(Item)
	DocSalesReportToConsignorClient.TradeAgentFeeTypeOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region PARTNER

&AtClient
Procedure PartnerOnChange(Item) Export
	DocSalesReportFromTradeAgentClient.PartnerOnChange(Object, ThisObject, Item);
EndProcedure

&AtClient
Procedure PartnerStartChoice(Item, ChoiceData, StandardProcessing)
	DocSalesReportFromTradeAgentClient.PartnerStartChoice(Object, ThisObject, Item, ChoiceData, StandardProcessing);
EndProcedure

&AtClient
Procedure PartnerEditTextChange(Item, Text, StandardProcessing)
	DocSalesReportFromTradeAgentClient.PartnerTextChange(Object, ThisObject, Item, Text, StandardProcessing);
EndProcedure

#EndRegion

#Region LEGAL_NAME

&AtClient
Procedure LegalNameOnChange(Item) Export
	DocSalesReportFromTradeAgentClient.LegalNameOnChange(Object, ThisObject, Item);
EndProcedure

&AtClient
Procedure LegalNameStartChoice(Item, ChoiceData, StandardProcessing)
	DocSalesReportFromTradeAgentClient.LegalNameStartChoice(Object, ThisObject, Item, ChoiceData, StandardProcessing);
EndProcedure

&AtClient
Procedure LegalNameEditTextChange(Item, Text, StandardProcessing)
	DocSalesReportFromTradeAgentClient.LegalNameTextChange(Object, ThisObject, Item, Text, StandardProcessing);
EndProcedure

#EndRegion

#Region AGREEMENT

&AtClient
Procedure AgreementOnChange(Item) Export
	DocSalesReportFromTradeAgentClient.AgreementOnChange(Object, ThisObject, Item);
EndProcedure

&AtClient
Procedure AgreementStartChoice(Item, ChoiceData, StandardProcessing)
	DocSalesReportFromTradeAgentClient.AgreementStartChoice(Object, ThisObject, Item, ChoiceData, StandardProcessing);
EndProcedure

&AtClient
Procedure AgreementEditTextChange(Item, Text, StandardProcessing)
	DocSalesReportFromTradeAgentClient.AgreementTextChange(Object, ThisObject, Item, Text, StandardProcessing);
EndProcedure

#EndRegion

#Region CURRENCY

&AtClient
Procedure CurrencyOnChange(Item)
	DocSalesReportFromTradeAgentClient.CurrencyOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region LEGAL_NAME_CONTRACT

&AtClient
Procedure LegalNameContractOnChange(Item)
	DocSalesReportFromTradeAgentClient.LegalNameContractOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region PRICE_INCLUDE_TAX

&AtClient
Procedure PriceIncludeTaxOnChange(Item)
	DocSalesReportFromTradeAgentClient.PriceIncludeTaxOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region ITEM_LIST

&AtClient
Procedure ItemListSelection(Item, RowSelected, Field, StandardProcessing)
	DocSalesReportFromTradeAgentClient.ItemListSelection(Object, ThisObject, Item, RowSelected, Field, StandardProcessing);
EndProcedure

&AtClient
Procedure ItemListBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	DocSalesReportFromTradeAgentClient.ItemListBeforeAddRow(Object, ThisObject, Item, Cancel, Clone, Parent, IsFolder, Parameter);
EndProcedure

&AtClient
Procedure ItemListBeforeDeleteRow(Item, Cancel)
	DocSalesReportFromTradeAgentClient.ItemListBeforeDeleteRow(Object, ThisObject, Item, Cancel);
EndProcedure

&AtClient
Procedure ItemListAfterDeleteRow(Item)
	DocSalesReportFromTradeAgentClient.ItemListAfterDeleteRow(Object, ThisObject, Item);
EndProcedure

#Region ITEM_LIST_COLUMNS

#Region _ITEM

&AtClient
Procedure ItemListItemOnChange(Item)
	DocSalesReportFromTradeAgentClient.ItemListItemOnChange(Object, ThisObject, Item);
EndProcedure

&AtClient
Procedure ItemListItemStartChoice(Item, ChoiceData, StandardProcessing)
	DocSalesReportFromTradeAgentClient.ItemListItemStartChoice(Object, ThisObject, Item, ChoiceData, StandardProcessing);
EndProcedure

&AtClient
Procedure ItemListItemEditTextChange(Item, Text, StandardProcessing)
	DocSalesReportFromTradeAgentClient.ItemListItemEditTextChange(Object, ThisObject, Item, Text, StandardProcessing);
EndProcedure

#EndRegion

#Region ITEM_KEY

&AtClient
Procedure ItemListItemKeyOnChange(Item)
	DocSalesReportFromTradeAgentClient.ItemListItemKeyOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region PRICE_TYPE

&AtClient
Procedure ItemListPriceTypeOnChange(Item)
	DocSalesReportFromTradeAgentClient.ItemListPriceTypeOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region CONSIGNOR_PRICE

&AtClient
Procedure ItemListConsignorPriceOnChange(Item)
	DocSalesReportFromTradeAgentClient.ItemListConsignorPriceOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region TRADE_AGENT_FEE_PERCENT

&AtClient
Procedure ItemListTradeAgentFeePercentOnChange(Item)
	DocSalesReportFromTradeAgentClient.ItemListTradeAgentFeePercentOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region TRADE_AGENT_FEE_AMOUNT

&AtClient
Procedure ItemListTradeAgentFeeAmountOnChange(Item)
	DocSalesReportFromTradeAgentClient.ItemListTradeAgentFeeAmountOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region UNIT

&AtClient
Procedure ItemListUnitOnChange(Item)
	DocSalesReportFromTradeAgentClient.ItemListUnitOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region QUANTITY

&AtClient
Procedure ItemListQuantityOnChange(Item)
	DocSalesReportFromTradeAgentClient.ItemListQuantityOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region QUANTITY_IN_BASE_UNIT

&AtClient
Procedure ItemListQuantityInBaseUnitOnChange(Item)
	DocSalesReportFromTradeAgentClient.ItemListQuantityInBaseUnitOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region QUANTITY_IS_FIXED

&AtClient
Procedure ItemListQuantityIsFixedOnChange(Item)
	DocSalesReportFromTradeAgentClient.ItemListQuantityIsFixedOnChange(Object, ThisObject, Item);	
EndProcedure

#EndRegion

#Region PRICE

&AtClient
Procedure ItemListPriceOnChange(Item, AddInfo = Undefined) Export
	DocSalesReportFromTradeAgentClient.ItemListPriceOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region TOTAL_AMOUNT

&AtClient
Procedure ItemListTotalAmountOnChange(Item, AddInfo = Undefined) Export
	DocSalesReportFromTradeAgentClient.ItemListTotalAmountOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region TAX_AMOUNT

&AtClient
Procedure ItemListTaxAmountOnChange(Item)
	DocSalesReportFromTradeAgentClient.ItemListTaxAmountOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region DONT_CALCULATE_ROW

&AtClient
Procedure ItemListDontCalculateRowOnChange(Item)
	DocSalesReportFromTradeAgentClient.ItemListDontCalculateRowOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region VAT_RATE

&AtClient
Procedure ItemListVatRateOnChange(Item) Export
	DocSalesReportFromTradeAgentClient.ItemListVatRateOnChange(Object, ThisObject, Item);
EndProcedure

#EndRegion

#Region SERIAL_LOT_NUMBERS

&AtClient
Procedure ItemListSerialLotNumbersPresentationStartChoice(Item, ChoiceData, StandardProcessing) Export
	SerialLotNumberClient.PresentationStartChoice(Object, ThisObject, Item, ChoiceData, StandardProcessing);
EndProcedure

&AtClient
Procedure ItemListSerialLotNumbersPresentationClearing(Item, StandardProcessing)
	SerialLotNumberClient.PresentationClearing(Object, ThisObject, Item, StandardProcessing);
EndProcedure

#EndRegion

#Region SOURCE_OF_ORIGINS

&AtClient
Procedure ItemListSourceOfOriginsPresentationStartChoice(Item, ChoiceData, StandardProcessing)
	SourceOfOriginClient.PresentationStartChoice(Object, ThisObject, Item, ChoiceData, StandardProcessing);
EndProcedure

&AtClient
Procedure ItemListSourceOfOriginsPresentationClearing(Item, StandardProcessing)
	SourceOfOriginClient.PresentationClearing(Object, ThisObject, Item, StandardProcessing);
EndProcedure

#EndRegion

#EndRegion

#EndRegion

#Region SERVICE

&AtClient
Function GetProcessingModule() Export
	Str = New Structure;
	Str.Insert("Client", DocSalesReportFromTradeAgentClient);
	Str.Insert("Server", DocSalesReportFromTradeAgentServer);
	Return Str;
EndFunction

#Region DESCRIPTION

&AtClient
Procedure DescriptionClick(Item, StandardProcessing)
	CommonFormActions.EditMultilineText(ThisObject, Item, StandardProcessing);
EndProcedure

#EndRegion

#Region TITLE_DECORATIONS

&AtClient
Procedure DecorationGroupTitleCollapsedPictureClick(Item)
	DocumentsClientServer.ChangeTitleCollapse(Object, ThisObject, True);
EndProcedure

&AtClient
Procedure DecorationGroupTitleCollapsedLabelClick(Item)
	DocumentsClientServer.ChangeTitleCollapse(Object, ThisObject, True);
EndProcedure

&AtClient
Procedure DecorationGroupTitleUncollapsedPictureClick(Item)
	DocumentsClientServer.ChangeTitleCollapse(Object, ThisObject, False);
EndProcedure

&AtClient
Procedure DecorationGroupTitleUncollapsedLabelClick(Item)
	DocumentsClientServer.ChangeTitleCollapse(Object, ThisObject, False);
EndProcedure

#EndRegion

#Region ADD_ATTRIBUTES

&AtClient
Procedure AddAttributeStartChoice(Item, ChoiceData, StandardProcessing) Export
	AddAttributesAndPropertiesClient.AddAttributeStartChoice(ThisObject, Item, StandardProcessing);
EndProcedure

&AtServer
Procedure AddAttributesCreateFormControl()
	AddAttributesAndPropertiesServer.CreateFormControls(ThisObject, "GroupOther");
EndProcedure

&AtClient
Procedure AddAttributeButtonClick(Item) Export
	AddAttributesAndPropertiesClient.AddAttributeButtonClick(ThisObject, Item);
EndProcedure

#EndRegion

#Region EXTERNAL_COMMANDS

&AtClient
Procedure GeneratedFormCommandActionByName(Command) Export
	ExternalCommandsClient.GeneratedFormCommandActionByName(Object, ThisObject, Command.Name);
	GeneratedFormCommandActionByNameServer(Command.Name);
EndProcedure

&AtServer
Procedure GeneratedFormCommandActionByNameServer(CommandName) Export
	ExternalCommandsServer.GeneratedFormCommandActionByName(Object, ThisObject, CommandName);
EndProcedure

#EndRegion

#Region COPY_PASTE

//@skip-check module-unused-method
&AtClient
Procedure CopyToClipboard(Command)
	CopyPasteClient.CopyToClipboard(Object, ThisObject);
EndProcedure

&AtClient
Procedure CopyToClipboardAfterSetSettings(CopySettings, AddInfo) Export
	If CopySettings = Undefined Then
		Return;
	EndIf;
	
	CopyPasteResult = CopyToClipboardServer(CopySettings);
	CopyPasteClient.AfterCopy(CopyPasteResult);
EndProcedure

&AtServer
Function CopyToClipboardServer(CopySettings)
	Return CopyPasteServer.CopyToClipboard(Object, ThisObject, CopySettings);
EndFunction

//@skip-check module-unused-method
&AtClient
Procedure PasteFromClipboard(Command)
	CopyPasteClient.PasteFromClipboard(Object, ThisObject);
EndProcedure

&AtClient
Procedure PasteFromClipboardAfterSetSettings(PasteSettings, AddInfo) Export
	If PasteSettings = Undefined Then
		Return;
	EndIf;
	
	CopyPasteResult = PasteFromClipboardServer(PasteSettings);
	CopyPasteClient.AfterPaste(Object, ThisObject,CopyPasteResult);
EndProcedure

&AtServer
Function PasteFromClipboardServer(CopySettings)
	Return CopyPasteServer.PasteFromClipboard(Object, ThisObject, CopySettings);
EndFunction

#EndRegion

#Region COMMANDS

&AtClient
Procedure InternalCommandAction(Command) Export
	InternalCommandsClient.RunCommandAction(Command, ThisObject, Object, Object.Ref);
EndProcedure

&AtClient
Procedure InternalCommandActionWithServerContext(Command) Export
	InternalCommandActionWithServerContextAtServer(Command.Name);
EndProcedure

&AtServer
Procedure InternalCommandActionWithServerContextAtServer(CommandName)
	InternalCommandsServer.RunCommandAction(CommandName, ThisObject, Object, Object.Ref);
EndProcedure

&AtClient
Procedure SearchByBarcode(Command, Barcode = "")
	DocumentsClient.SearchByBarcodeWithPriceType(Barcode, Object, ThisObject);
EndProcedure

&AtClient
Procedure ShowRowKey(Command)
	DocumentsClient.ShowRowKey(ThisObject);
EndProcedure

//@skip-check module-unused-method
&AtClient
Procedure OpenSerialLotNumbersTree(Command)
	SerialLotNumberClient.OpenSerialLotNumbersTree(Object, ThisObject);
EndProcedure

#EndRegion

&AtClient
Procedure EditCurrencies(Command)
	FormParameters = CurrenciesClientServer.GetParameters_V3(Object);
	NotifyParameters = New Structure();
	NotifyParameters.Insert("Object", Object);
	NotifyParameters.Insert("Form"  , ThisObject);
	Notify = New NotifyDescription("EditCurrenciesContinue", CurrenciesClient, NotifyParameters);
	OpenForm("CommonForm.EditCurrencies", FormParameters, , , , , Notify, FormWindowOpeningMode.LockOwnerWindow);
EndProcedure

&AtClient
Procedure EditQuantityInBaseUnit(Command)
	Items.ItemListQuantityInBaseUnit.Visible = Not Items.ItemListQuantityInBaseUnit.Visible;
	Items.ItemListQuantityIsFixed.Visible = Not Items.ItemListQuantityIsFixed.Visible;	 	
EndProcedure

&AtClient
Procedure ShowHiddenTables(Command)
	DocumentsClient.ShowHiddenTables(Object, ThisObject);
EndProcedure

#EndRegion
